app/controllers/admin/orders_controller.rb

  def index
    @orders = Order.order("id DESC")
---
SELECT "orders".* FROM "orders"  ORDER BY id DESC

  def ship
    @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 6]]

  def shipped
    @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 6]]

  def cancel
    @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 5]]

  def return
    @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 6]]