app/controllers/admin/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("title", "description", "quantity", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Product 1"], ["description", "best !"], ["quantity", 3], ["price", 3000], ["created_at", "2016-03-09 02:25:54.846322"], ["updated_at", "2016-03-09 02:25:54.846322"]]

  def edit
    @product = Product.find(params[:id])
    @form_options = { submit_text: "Update", disable_text: "Updating" }

    if @product.photo.present?
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."product_id" = ? LIMIT 1  [["product_id", 1]]

  def update
    @product = Product.find(params[:id])

    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "title" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "Product 2"], ["updated_at", "2016-03-09 02:48:37.555891"], ["id", 2]]