app/views/admin/orders/index.html.erb

SELECT "orders".* FROM "orders"  ORDER BY id DESC
---

rails g controller account::orders