app/controllers/account/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  ORDER BY id DESC  [["user_id", 1]]
---
  def index
    @orders = current_user.orders