app/views/carts/checkout.html.erb

            <tbody>
                <% current_cart.items.each do |product| %>
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 1]]