app/views/carts/index.html.erb


        <% current_cart.items.each do |product| %>
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."product_id" = 2 LIMIT 1  [["cart_id", 1]]

              <%= link_to product_path(product) do %>
                <% if product.photo.present? %>
---
SELECT  "photos".* FROM "photos" WHERE "photos"."product_id" = ? LIMIT 1  [["product_id", 1]]