app/controllers/cart_items_controller.rb

  def destroy
    @cart = current_cart
    @item = @cart.cart_items.find_by(product_id: params[:id])
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."product_id" = ? LIMIT 1  [["cart_id", 1], ["product_id", 1]]