app/controllers/carts_controller.rb

  def checkout

    if current_cart.cart_items.blank?
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 1]]