app/controllers/cart_items_controller.rb

	def destroy
		@cart = current_cart
		@cart_item = @cart.cart_items.find(params[:id])
		if @cart_item
			@product = @cart_item.product
			@cart_item.destroy
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 3]]

	def update
		@cart = current_cart
		@item = @cart.cart_items.find(params[:id])
		@product = @item.product
		old_quantity = @item.quantity
		new_quantity = cart_item_params[:quantity].to_i
		quantity_changed = new_quantity - old_quantity

		if (quantity_changed <= @product.quantity)
			@item.update(cart_item_params)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 3], ["updated_at", "2016-03-09 14:55:55.163838"], ["id", 4]]