app/controllers/orders_controller.rb

INSERT INTO "orders" ("user_id", "created_at", "updated_at", "token") VALUES (?, ?, ?, ?)  [["user_id", 1], ["created_at", "2016-03-09 13:16:43.371675"], ["updated_at", "2016-03-09 13:16:43.371675"], ["token", "6311f8a8-fe7b-4b41-88dd-16e751558512"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 4]]
---
  def create
    @order = current_user.orders.build(order_params)

    if @order.save
      @order.build_item_cache_from_cart(current_cart)
      @order.calculate_total!(current_cart)
      current_cart.cart_items.destroy_all

SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT 1  [["token", "6311f8a8-fe7b-4b41-88dd-16e751558512"]]
---
  def show
    @order = Order.find_by_token(params[:id]) #find_by_token????

SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT 1  [["token", "6311f8a8-fe7b-4b41-88dd-16e751558512"]]
---
  def pay_with_credit_card
    @order = Order.find_by_token(params[:id])