app/controllers/products_controller.rb

  def add_to_cart
    @product = Product.find(params[:id])

    if !current_cart.items.include?(@product)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "products" INNER JOIN "cart_items" ON "products"."id" = "cart_items"."product_id" WHERE "cart_items"."cart_id" = ? AND "products"."id" = ? LIMIT 1  [["cart_id", 2], ["id", 1]]