app/views/products/index.html.erb

      <%= link_to product_path(product) do %>
        <% if product.photo.present? %>
---
SELECT  "photos".* FROM "photos" WHERE "photos"."product_id" = ? LIMIT 1  [["product_id", 1]]