app/views/products/show.html.erb

		<div class="col-md-12" id="product-image">
			<% @product.photos.each do |photo| %>
---
SELECT  "photos".* FROM "photos" WHERE "photos"."product_id" = ? LIMIT 1  [["product_id", 1]]